# Shell
brew "zsh"
brew "starship"
brew "atuin"

# Core Apps
brew "neovim"
brew "tmux"
brew "yazi"
brew "poppler"
brew "imagemagick"
brew "resvg"
brew "p7zip"

# CLI Tools
brew "tree-sitter-cli"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "bat"
brew "jless"
brew "eza"
brew "lazygit"
brew "git-delta"
brew "zoxide"
brew "exiftool"
brew "mediainfo"
brew "trash-cli"
brew "tldr"
brew "bottom"
brew "xclip" if OS.linux?

# Media
brew "mpv"
